Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་ པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་ རྫ་མཁན་ ནམ །_ རྫ་མཁན་ གྱི་ སློབ་མ་ མཁས་པ་ ཞིག་ གིས་ རྫ་མཁན་ གྱི་ འཕང་ལོ་ ལ་ དབྱུག་ གུས་ བཙུགས་པ་ འཁོར་བ ར་ བྱེད་ ཅིང་ །_ མིག་ ཀྱང་ སྦྲིད་པ ར་ བྱེད་པ་ དེ་བཞིན་ དུ་ དེ འི་ ཚེ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་ རྟེན་ གྱི་ ཁམས་ དེ་ ཡོངས་སུ་ བསྒྱུར་ ནས་ |#| མངོན་པར་ བཏེག་ གོ །_།
en: Then, as if he had become a potter, or a potter’s apprentice, who is spinning his wheel with a stick so fast that it blurs visual perception, the bodhisattva now transformed the trichiliocosm and lifted it up.

source: དེ་ནས་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ མངོན་པར་ བཏེག་ ཅིང་ ཀུན་ ཏུ་ འཁྲུགས་པ་ དང་ །_ བཅོམ་ལྡན་འདས་ ལ་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: As he lifted up the world and shook it, the venerable Śāradvatī­putra cried out to the Blessed One,

source: བཅོམ་ལྡན་འདས་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ ཁྲིད་ ལགས་སོ །_།
en: “Blessed One, the world is moving!

source: བདེ་བ ར་ གཤེགས་པ་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ ཁྲིད་ ལགས་སོ །_།
en: Blissful One, the world is moving!”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ རྣ ར་ སྙན་པ་ དང་ །_ སྙན་ ཅིང་ འཇེབས་པ་ དང་ །_ དགའ་བ ར་ བྱེད་པ་ དང་ །_ མཉན་པ ར་ འོས་པ་ དང་ །_ ཡིད་ དུ་ འོང་བ་ དང་ །_ ཕོ་བྲང་ འཁོར་ སྐྱོང་ གི་ སྐད་ དང་ །_ སྐྱེ་བོ་ མང་པོ་ དགའ་བ་ དང་ །_ ཟབ་པ་ དང་ །_ མ་ཚང་བ་ མེད་པ་ དང་ །_ ཤིན་ཏུ་ རྣམ་པར་ རིག་པ ར་ བྱེད་པ་ ཡེ་ཤེས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ ཚིག་ གིས་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ ལ་ བཀའ་ སྩལ་པ །_
en: $198 In response, the Blessed One spoke in a way that was delightful, gentle, harmonious, pleasant, compelling, courteous, widely agreeable, profound, comprehensive, instructive, and guided by wisdom.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ ལ་ ང་ ལ་ དབང་མེད་ དོ་ ཞེས་ དེ་སྐད་ ཅེས་ བཀའ་ སྩལ་ ནས
en: Thus he said to the venerable Śāradvatī­putra, “Śāradvatī­putra, in this regard I am powerless,” and

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ གོ་བ ར་ མཛད་ དོ །_།
en: he made this known throughout the entire trichiliocosm.

source: དེ་ལྟ ར་ དེ འི་ ཚེ་ སེམས་ཅན་ གང་དག་ འཇིག་ཚོགས་ ལ་ ལྟ་བ་ ཀུན་ ཏུ་ ཆགས་པ་ དང་ །_ འཇིག་ཚོགས་ ལ་ ལྟ་བ་ ལ་ གནས་པ་ དང་ །_ འཇིག་ཚོགས་ ལ་ རྟེན་པ་ དེ་ དག་ ཐམས་ཅད་ དེ འི་ ཚེ་ སྐྱོ་བ ར་ གྱུར་ ཅིང་ སྐྱོ་བ་ ཐོབ་བོ །_།
en: Hence, at this point all beings who were attached to, confined to, or dependent on the view of the transitory collection became saddened and weary.

source: དེ་ལྟ ར་ འཁོར་ བཞི་པོ་ དག་ གིས་ ནི་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ བྱང་ཆུབ་ སེམས་དཔ ས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ ཆོས་སྟོན་པ་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ རྒྱལ་པོ་ བཞིན་ དུ་ ཆོས་ ཀྱི་ གདན་ ལ་ [37a] བཞུགས་ ཤིང་ ཆོས་སྟོན་པ །_ མི་མཇེད་ ཀྱི་ བདག་པོ་ ཚངས་པ་ བཞིན་ དུ་ ཚངས་པ ས་ ཡོངས་སུ་ བསྐོར་ ཏེ་ |#| ཚངས་པ འི་ གདན་ ལ་ བཞུགས་ ཤིང་ ཆོས་སྟོན་པ་ མཐོང་ ངོ་ །_།
en: All four assemblies saw the thus-gone one, the blessed one, the perfect Buddha, surrounded by bodhisattvas, teaching the Dharma while residing on the Dharma throne like a universal emperor. [37.a] They saw him as Brahmā, the lord of Enduring, seated upon his Brahmā-throne and surrounded by Brahmā deities, teaching the Dharma.

source: དེ་ནས་ དེ འི་ ཚེ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གཞན་ ཡང་ཡང་ དག་པ ར་ བསྟན་པ་ བྱས་ སོ །_།
en: $199 The bodhisattva Saha­cittotpāda­dharma­cakra­pravartin now also revealed other buddha realms.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཇི་ལྟ་བུ འི་ རྫུ་འཕྲུལ་ མངོན་པར་ འདུ་ བྱ་བ་ མངོན་པར་ འདུ་ མཛད་པ ས་ རླུང་ གི་ དཀྱིལ་འཁོར་ ཆེན་པོ་ མངོན་པར་ སྤྲུལ་པ་ མཛད་པ་ དེ་ལྟ་ བུ འི་ རྫུ་འཕྲུལ་ མངོན་པར་ འདུ་ བྱ་བ་ མངོན་པར་ འདུ་ མཛད་ དོ །_།
en: Then, at this point, the Blessed One performed a miracle,

source: ཅི་ ནས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་དག་ ཕན་ཚུན་ ཐུག་པ ར་ མཛད་ དོ །_།
en: bringing forth a strong swirling wind that caused the buddha realms to touch one another.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་དག་ ཀྱང་ ཁོང་སྟོང་ དུ་ གྱུར་ ཅིང་ བུ་ག་ བྱུང་བ ར་ གྱུར་ ཏེ །_ |#| སོ་སོ ར་ ཞིག་ ཅིང་ རབ་ཏུ་ རྣམ་པར་ ཞིག་ གོ །_།
en: The worlds became hollow and perforated, so that they fell apart and were destroyed.

source: དེ་ལྟ ར་ དེ འི་ ཚེ་ དེ་བཞིན་ གཤེགས་ པ འི་ ཆོ་འཕྲུལ་ ཆེན་པོ་ དེ་ལྟ་ བུ་ དེ་ཡང་ དག་པ ར་ བསྟན་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ ན་ གང་དག་ ལྟ་བ འི་ འདུ་ཤེས་ ཅན །_ རྟག་པ་ དང་ ཐེར་ཟུག་ གི་ འདུ་ཤེས་ ཅན་ ཚངས་པ འམ །_ ཚངས་པ་ ཆེན་པོ་ དེ་དག་ ནི་ རང་རང་ གི་ ཚངས་པ འི་ གནས་ ཞིག་ ཅིང་ །_ རབ་ཏུ་ རྣམ་པར་ ཞིག་ ལ་ འདི་ལྟ་སྟེ །_
en: As the Thus-Gone One performed this miraculous feat, the Brahmās and Mahābrahmās of this world, who had otherwise conceived in terms of views, permanence, and the everlasting, now witnessed the collapse and complete destruction of their Brahmā abodes.

source: དཔེར་ན་ ཆུ འི་ ཕུང་པོ་ ཆེན་པོ ས་ དབུ་བ་ རྡོ ས་པ་ ཆེན་པོ་ བསྐྱེད་ ན་ |#| མངོན་པར་ འཇིག་པ་ དང་ །_ རླུང་ གི་ ཕུང་པོ་ ཆེན་པོ ས་ གཏོར་ ན་ |#| རྡུལ་ དུ་ འགྱུར་ ཞིང་ རབ་ཏུ་ འཇིག་པ་ དེ་བཞིན་ དུ་
en: It was as if a great mass of water had produced an abundance of bubbles and foam, which a storm then scattered, breaking everything into particles. |#| In this way

source: ཚངས་པ་ དེ་དག་ རང་རང་ གི་ གནས་ སུ་ དོང་ ནས་ |#| རྡུལ་ དུ་ འགྱུར་ ཞིང་ འཇིག་པ་ དག་ མཐོང་ ངོ་ །_།
en: the Brahmā deities witnessed the loss, demolition, and collapse of their abodes.

source: མཐོང་ ནས་ ཀྱང་ ཤས་ ཆེ ར་ སྐྱོ་བ ར་ གྱུར་ ཏོ །_།
en: Seeing all this they despaired, and

source: དེ་དག་ སྐྱོ་བ ར་ གྱུར་ ནས་ བཅོམ་ལྡན་འདས་ ཉག་གཅིག་ ལ་ ཕྱག་ འཚལ་ ཞིང་ འཁོད་ དོ །_།
en: in despair they all prostrated to and gathered around the Blessed One.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $200 Then the Blessed One said to Śāradvatī­putra,

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ངས་ སྔོན་ ཡང་ བསྟན་པ་ ཡིན་ ལ །_ ད་ ཡང་ བསྟན་པ ར་ བྱ་ སྟེ །_
en: “Śāradvatī­putra, I have explained this before, and I shall now do so again.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཀྱེ་མ་ འཇིག་རྟེན་ གནས་པ་ འདི་ ནི་ ཡོངས་སུ་ སྦག་པ ས་ ཡོངས་སུ་ སྦགས་པ འོ །_།
en: Ah, Śāradvatī­putra, this worldly existence is defiled and polluted.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཀྱེ་མ་ འཇིག་རྟེན་ གནས་པ་ འདི་ ནི་ སྙིང་པོ་ མེད་པ་ ཉིད་ ཀྱི་ ཕྱིར་ དང་ །_ སྒྱུ་མ་ ལྟ་བུ འི་ ཕྱིར་ དབུ་བ་ [37b] རྡོ ས་པ་ ལྟ་བུ ར་ གཟུང་ དུ་ མེད་པ འོ །_།
en: Ah, Śāradvatī­putra, this world is futile and like an illusion, and hence it is like a water bubble [37.b] that cannot be grasped.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཀྱེ་མ་ འཇིག་རྟེན་ གནས་པ་ འདི་ ནི་ ཕྱིན་ ཅི་ ལོག་ ཏུ་ ཀུན་བརྟགས་པ འི་ ཕྱིར་ སྒྱུ་མ་ ལྟ་བུ འོ །_།
en: Ah, Śāradvatī­putra, this worldly existence is falsely conceived, and hence it is like a magic trick.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཀྱེ་མ་ འཇིག་རྟེན་ གནས་པ་ འདི་ ནི་ ནམ་མཁའ་ ལ་ ཀུན་ དུ་ རྒྱུག་པ འི་ ཀུན་ དུ་ རྟོགས་པ ས་ ཡོངས་སུ་ བཅད་པ འི་ ཕྱིར་ སྨིག་རྒྱུ་ ལྟ་བུ འོ །_།
en: Ah, Śāradvatī­putra, this worldly existence is discerned by the swift thoughts in space, and hence it is like a mirage.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཀྱེ་མ་ འཇིག་རྟེན་ གནས་པ་ འདི་ ནི་ དངོས་པོ ར་ གཟུང་ དུ་ མེད་པ འི་ ཕྱིར་ མིག་ཡོར་ ལྟ་བུ འོ །_།
en: Ah, Śāradvatī­putra, this worldly existence contains nothing solid to be grasped, and hence it is like a hallucination.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཀྱེ་མ་ འཇིག་རྟེན་ གནས་པ་ འདི་ ནི་ ནམ་མཁ འི་ ཀུན་ དུ་ རྟོག་པ འི་ ལས་ ཀྱིས་ ཀུན་ ནས་ བསླང་བ འི་ ཕྱིར་ བྲག་ཅ་ ལྟ་བུ འོ །_།
en: Ah, Śāradvatī­putra, this worldly existence is conjured up by the actions of thought in space, and hence it is like an echo.

source: ཤ་ར་དྭ་ ཏི འི་ བུ་ འཇིག་རྟེན་ གནས་པ་ འདི་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཤ་ར་དྭ་ཏི འི་ བུ་ འཇིག་རྟེན་ གནས་པ་ འདི་ ཕྱིན་ ཅི་ ལོག་ ཏུ་ དེ་བཞིན་ གཤེགས་པ ས་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ སོ །_།
en: Śāradvatī­putra, this worldly existence is false and, by realizing that, the Thus-Gone One has attained perfect buddhahood.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཀྱེ་མ་ འཇིག་རྟེན་ གནས་པ་ འདི་ ནི་ གསོག་ ཡིན་ ཏེ །_
en: Ah, Śāradvatī­putra, this worldly existence is fake, and so,

source: ཀྱེ་མ་ འཇིག་རྟེན་ གནས་པ་ འདི་ ནི་ ཆགས་པ་ མེད་པར་ དེ་བཞིན་ གཤེགས་པ ས་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ སོ །_།
en: by not being attached to this world, the Thus-Gone One has attained perfect buddhahood.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འཇིག་རྟེན་ འདི་ ནི་ རོ་མྱང་བ་ མེད་པ་ དང་ །_ ཉེས་དམིགས་ དང་ །_ ངེས་པ ར་ འབྱུང་བ་ མེད་པ འི་ བར་ དུ་ ཡང་དག་པ་ ཇི་ལྟ་ བ་ བཞིན་ དུ་ ངས་ མངོན་པར་ མཁྱེན་ ཏེ །_
en: $201 “Śāradvatī­putra, I have exact knowledge that this worldly existence has no experience to savor, and many shortcomings up to having no emancipation.

source: དེ་ལྟ ར་ ངས་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ པར་ བདག་ཉིད་ མངོན་པར་ མཁྱེན་ ཏོ །_།
en: In this way I have full knowledge of how to awaken to unexcelled and perfect buddhahood.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ངས་ འཇིག་རྟེན་ འདི་ ཇི་ལྟ་བ་ བཞིན་ དུ་ མངོན་པར་ མཁྱེན་པ་ དེ་བཞིན་ དུ་ འཇིག་རྟེན་ ཀུན་འབྱུང་བ་ དང་ །_ འཇིག་རྟེན་ འགོག་པར་ འགྱུར་བ འི་ ལམ་ ཡང་ མངོན་པར་ མཁྱེན་ ཏེ །_
en: I have exact knowledge of this world, Śāradvatī­putra, just as I have clear knowledge of its origin and the path that leads to its cessation.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ད་ལྟ ར་ ངས་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ པར་ བདག་ཉིད་ མངོན་པར་ མཁྱེན་ ཏོ །_།
en: At this moment, Śāradvatī­putra, I possess clear knowledge of how to awaken to unexcelled and perfect buddhahood.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ འཇིག་རྟེན་ གང་ཞེ་ན །_
en: $202 “Śāradvatī­putra, you may wonder what the world is.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འཇིག་རྟེན་ ཞེས་ བྱ་བ་ ནི་ ཕུང་པོ་ ལྔ་ དག་ གོ །_།
en: Śāradvatī­putra, the so-called world is the five aggregates.

source: ལྔ་ གང་ཞེ་ན །_
en: What are those five?

source: གཟུགས་ ཀྱི་ ཕུང་པོ་ དང་ །_ ཚོར་བ འི་ ཕུང་པོ་ དང་ །_ འདུ་ཤེས་ ཀྱི་ ཕུང་པོ་ དང་ །_ འདུ་བྱེད་ ཀྱི་ ཕུང་པོ་ དང་ །_ རྣམ་པར་ ཤེས་པ འི་ ཕུང་པོ འོ །_།
en: They are the aggregates of form, feeling, perception, formation, and consciousness.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ གཟུགས་ ཀྱི་ ཕུང་པོ་ གང་ཞེ་ན །_
en: Śāradvatī­putra, you may then wonder what is understood by the aggregate of form.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཟུགས་ ཀྱི་ ཕུང་པོ་ ནི་ དེ་བཞིན་ གཤེགས་ [38a] པས་ འདས་པ་ དང་ །_ མ་འོངས་པ་ དང་ །_ ད་ལྟ ར་ བྱུང་བ་ སྤངས་པ་ སྟེ །_
en: Śāradvatī­putra, the Thus-Gone One [38.a] has relinquished the aggregate of form in all its past, future, and present manifestations.

source: དེ་ ལ་ ངས་ འདས་པ་ དང་ །_ མ་འོངས་པ་ དང་ །_ ད་ལྟ ར་ བྱུང་བ འི་ གཟུགས་ ཀྱི་ ཕུང་པོ་ གང་ སྤངས་པ་ དེ་ ནི་ སེམས་ཅན་ རྣམས་ གང་ འདས་པ་ དང་ །_ གང་ མ་འོངས་པ་ དང་ །_ གང་ ད་ལྟ ར་ བྱུང་བ་ དེ་ ཐམས་ཅད་ ནི་ གཟུགས་ ཀྱི་ ཕུང་པོ་ མ་ ཡིན་ ནོ་ ཞེས་ དེ་སྐད་ ཅེས་ སྨྲ་བ ར་ གྱུར་ ན་ |#| མི་ རུང་ སྟེ
en: However, while I have relinquished the aggregate of form in all its past, future, and present manifestations, it would be wrong to say that the sentient beings in the past, future, and present are not the aggregate of form.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ནང་ ངམ །_ ཕྱི་རོལ་ ལམ །_ ཆེན་པོ འམ །_ ཆུང་ངུ འམ །_ བཟང་པོ འམ །_ ངན་པ འམ །_ གང་དག་ རྒྱང་རིང་བ འམ །_ གང་དག་ ཐག་ ཉེ་བ་ དུས་གསུམ་ དུ་ བསྡུས་པ་ དེ་དག་ ཐམས་ཅད་ ནི་ གཟུགས་ ཀྱི་ ཕུང་པོ་ སྟེ །_ |#| མཚན་ཉིད་ མེད་ དོ་ ཞེས་ བསྟན་ ཏོ །_།
en: Śāradvatī­putra, whether inner or outer, large or small, good or bad, distant or close, the Thus-Gone One teaches that all the aggregate of form, as contained within the three times, is devoid of characteristics.

source: དཔེར་ན་ ནམ་མཁ འི་ ཕུང་པོ་ ནི་ རླུང་ གི་ རྣམ་པ་ དང་ །_ ཆུ འི་ རྣམ་པ་ དང་ །_ མེ འི་ རྣམ་པ་ དང་ །_ ས འི་ རྣམ་པ་ ཡིན་པ་ དེ་བཞིན་ དུ་ གཟུགས་ ཀྱི་ ཕུང་པོ་ དང་ །_ ཚོར་བ འི་ ཕུང་པོ་ དང་ །_ འདུ་ཤེས་ ཀྱི་ ཕུང་པོ་ དང་ །_ འདུ་བྱེད་ ཀྱི་ ཕུང་པོ་ དང་ །_ རྣམ་པར་ ཤེས་པ འི་ ཕུང་པོ ར་ བརྗོད་པ ར་ བྱ འོ །_།
en: As an analogy, just as the aggregate of space possesses the features of wind, water, fire, and earth, the same can be said with respect to the aggregates of form, feeling, perception, formation, and consciousness.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཅིའི་ཕྱིར་ འདི་སྐད་ ཅེས་ གཟུགས་ ཀྱི་ ཕུང་པོ་ ཞེས་ བྱ་ ཞེ་ན །_
en: $203 “You may wonder, Śāradvatī­putra, why it is referred to as the aggregate of form .

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱིས་པ་ སོ་སོ འི་ སྐྱེ་བོ་ རྣམས་ ནི་ མུན་པ ར་ གྱུར་པ་ སྟེ །_
en: Śāradvatī­putra, childish, ordinary beings are in darkness.

source: དེ་དག་ ལུས་ ལ་ གཟུགས་ ཀྱི་ མཚན་ཉིད་ ཇི་ལྟ་བ་ བཞིན་ དང་ །_ ཇི་སྙེད་པ་ རབ་ཏུ་ མི་ ཤེས་པ ས་ བདག་ གཟུགས་ ཡིན་ ནོ །_།
en: They do not recognize the full extent and nature of the characteristics of form as found in the body.

source: གཟུགས་ བདག་ གི་ ཡིན་ ནོ་ ཞེས་ རྣམ་པར་ རྟོག་པ ར་ བྱེད་ ལ །_
en: Thus, they think instead, ‘I am form’ or ‘Form is me.’

source: བདག་ གོ་ ཞེས་ ཀྱང་ ཀུན་ དུ་ ཤེས་ ཤིང་གནས་ པར་ བྱེད་ དེ །_
en: Thus, they cognize and structure things in terms of ‘I.’

source: རློམ་སེམས་ སུ་ བྱེད་པ ས་ དངོས་པོ་ དེ་ ལ་ ཡོངས་སུ་ སྲེད་པ་ སྐྱེད་པ ར་ བྱེད་ དེ །_
en: This produces arrogance and, in turn, craving for things.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དངོས་པོ འི་ ཚུལ་ ཤེས་པ་ དེ་ ནི་ དེ་ལྟ་ མ་ ཡིན་ ནོ །_།
en: Yet, Śāradvatī­putra, when the nature of things is known, that is not the case.

source: དེ་དག་ ནི་ དེ་ལྟ ར་ མིག་ དང་ གཟུགས་ དངོས་པོ་ མེད་ དོ་ ཞེས་ ཤེས་པ་ མི་ སྐྱེད་ དེ །_
en: $204 “Childish, ordinary beings do not comprehend that neither the eye nor form is an entity.

source: དེ་ ལྟ ར་ མེད་པ འི་ ཆོས་ རྣམས་ ཡོངས་སུ་ གཟུང་ ནས་ བྱིས་པ་ རྣམས་ རྟོགས་པ་ སྐྱེད་པ ར་ བྱེད་ དོ །_།
en: Instead, their thoughts are based on holding on to entities that do not exist as such.

source: རྟོག་པ་ སྐྱེས་པ འི་ བྱིས་པ་ དེ་དག་ ནི་ དངོས་པོ་ དེ་ ལ་ འཇུག་པ ར་ འགྱུར་ ཞིང་ །_ དེ་དག་ གི་ ཉེས་པ འི་ ཁམས་ དག་ ཀྱང་ སྐྱེ་བ ར་ འགྱུར་ རོ །_།
en: Childish beings who think in this way thus engage with entities and so take birth within flawed realms.

source: དེ་ལྟ ར་ དངོས་པོ་ མེད་པ །_ སྤྱོད་ཡུལ་པ །_ [38b] ཁ་དོག་ དང་ བྲལ་བ་ སྤྱོད་ཡུལ་པ །_ ཁ་དོག་ མེད་པ །_ སྤྱོད་ཡུལ་པ་ དེ་དག་ ནི་ ཤས་ ཆེ ར་ རྨོངས་པ ར་ འགྱུར་ རོ །_།
en: Those who thus experience nonentities, [38.b] the colorless, that which has no color, are indeed greatly bewildered.

source: རྨོངས་པ་ དེ་དག་ ནི་ ཞིང་ལས་ བྱེད་པ ར་ འགྱུར་ ཞིང་ །_ མཚོན་ཆ་ སྣ་ཚོགས་ ཀྱིས་ འདེབས་པ་ ལྷུར་ལེན་ པར་ ཡང་ འགྱུར་ རོ །_།
en: Such bewildered beings pursue agriculture, and engage in the use of all sorts of weapons.

source: དེ་དག་ གི་ མངོན་པར་ འདུ་བྱེད་པ་ དེ་ ནི་ རྨོངས་པ་ ཡིན་ ནོ །_།
en: The factor that conditions them is delusion.

source: དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ ས་ ནི་ དངོས་པོ་ མཉམ་པ་ཉིད་ ཀྱིས་ ལྟ་བ་ མཉམ་པ་ཉིད་ རྗེས་སུ་ སངས་རྒྱས་ ཤིང་ །_ དེ་ རྗེས་སུ་ སངས་རྒྱས་ པས་ ཡང་དག་པ འི་ ལྟ་བ་ འདོགས་པ ར་ མངོན་པར་ མཛད་ དེ །_
en: $205 “Due to the sameness of things, the Thus-Gone One has a view of sameness. |#| Having thus gained awakening he has formulated the true view.

source: ལྟ་བ་ དེ་ ནི་ མཉམ་པ་ ཡིན་པ ས་ དེས་ན་ ཡང་ དག་པ འི་ ལྟ་བ་ ཞེས་ བྱ འོ །_།
en: Because that view is equality, it is referred to as the true view .

source: ཡང་དག་ པར་ བརྩོན་པ་ རྣམས་ དང་ །_ ཡང་དག་ པར་ རྣམ་པར་ གྲོལ་བ་ རྣམས་ ཀྱི་ ལྟ་བ་ དེ་ ནི་ ཡང་དག་ པར་ ཞུགས་པ་ ཡིན་པ ས་ དེས་ན་ ཡང་དག་པ འི་ ལྟ་བ་ ཞེས་ བྱ འོ །_།
en: It is called the true view because it is adhered to by those who are truly diligent and truly liberated.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ངས་ ཡང་དག་པ འི་ ལྟ་བ་ གང་ བཤད་པ་ དེ་ ནི་སྒྲ ས་ བསྟན་པ ར་ མི་ ནུས་ ཏེ །_
en: Śāradvatī­putra, the true view that I declare cannot be taught through language.

source: བསྟན་པ ར་ བཟོད་པ ར་ དཀའ་བ་ ཡིན །_
en: Its teaching is hard to bear.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ སྒྲུབས་ ཤིག་ དང་ བསྒྲུབས་ ན་ ཁྱེད་ཅག་ ཀྱང་ མུན་པ་ མེད་པར་ འགྱུར་ རོ །_།
en: Practice it, Śāradvatī­putra. |#| If you do, you will also be free of darkness.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ཆོས་ ཀྱི་ ཕུང་པོ་ འདི་ ནི་ འཁོར་ ཆོས་ ཀྱི་ ཕུང་པོ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ དང་ ལྡན་པ་ ཞེས་ བྱ འོ །_།
en: $206 “Śāradvatī­putra, this section of the Dharma is said to be accompanied by eighty-four thousand Dharma teachings.

source: འདི་ ནི་ འདུས་ བྱས་ དང་ །_ འདུས་མ་བྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཀྱི་ སྒོ་ ཡིན་ ཏེ །_
en: This is the gateway to all conditioned and unconditioned phenomena, and

source: ཆོས་ ཀྱི་ ཚུལ་ ཡང་ དེ་ ཡིན་ ནོ །_།
en: it is the way of all phenomena.”

source: དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀྱིས་ ཆོས་ ཀྱི་ ཕུང་པོ་ བསྟན་པ་ འདི་ བཤད་པ་ ན་ ཁྲག་ཁྲིག་ ཕྲག་ བདུན་ཅུ་ རྩ་ བདུན་ ནི་ ཆོས་ རྣམས་ ལ་ ཆོས་ ཀྱི་ མིག་ རྡུལ་མེད་ ཅིང་ དྲི་མ་ དང་ བྲལ་བ་ རྣམ་པར་ དག་ གོ །_།
en: $207 When the thus-gone one, the worthy one, the perfect Buddha delivered this teaching of the Dharma, seven hundred and seventy billion beings gained the stainless and immaculate Dharma eye that sees all phenomena.

source: འདོད་པ་ ན་ སྤྱོད་པ འི་ ལྷ་ ཁྲག་ཁྲིག་ ཀྱང་ ཆོས་ རྣམས་ ལ་ ཆོས་ ཀྱི་ མིག་ རྡུལ་མེད་ ཅིང་ དྲི་མ་ དང་ བྲལ་བ་ རྣམ་པར་ དག་ གོ །_། |#| མི འི་ སྐྱེ་དགུ འི་ སེམས་ཅན་ དཔག་ ཏུ་ མེད་པ་ དག་ ཀྱང་ ཆོས་ རྣམས་ ལ་ ཆོས་ ཀྱི་ མིག་ རྡུལ་ མེད་ ཅིང་ དྲི་མ་ དང་ བྲལ་བ་ རྣམ་པར་ དག་ གོ །_།
en: Within the desire realm a billion gods attained this, as did innumerable human beings.

source: འཛམ་བུ འི་ གླིང་པ་ བྱེ་ བ་ བརྒྱ་ ཕྲག་ ཇི་སྙེད་ ཡོད་པ་ དང་ །_ དེ་དག་ གི་ ནང་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ གང་དག་ གནས་པ་ དེ་དག་ ནི་ མི་ སྐྱེ་བ འི་ ཆོས་ ལ་ བཟོད་པ་ ཐོབ་པ ར་ གྱུར་ ཏོ །_།
en: Among the billions of such humans who lived on Jambudvīpa, those who were bodhisattvas also gained acceptance that phenomena are unborn.

source: སེམས་ཅན་ དཔག་ ཏུ་ མེད་པ་ དག་ གིས་ ནི་ བླ་ ན་ མེད་ [39a] པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ དོ །_།
en: Innumerably many beings [39.a] set their minds on unexcelled and perfect awakening.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ རྫུ་འཕྲུལ་ མངོན་པར་ འདུ་ མཛད་པ་ དེ་ཕྱིར་ བསྡུ་བ་ མཛད་ དོ །_།
en: $208 Then the Blessed One withdrew his miraculous activity, and

source: དེ་ནས་ འཁོར་ བཞི་པོ་ དང་ །_ ཚངས་པ འི་ འཁོར་ དེ་ |#| དང་ །_ འདོད་པ་ ན་ སྤྱོད་པ འི་ ལྷ འི་ འཁོར་ དང་ །_ གཞན་ ཡང་ ལྷ་ དང་ །_ ཀླུ་ དང་ །_ གནོད་སྦྱིན་ དང་ །_ དྲི་ཟ་ དང་ །_ ལྷ་མ་ ཡིན་ དང་ །_ ནམ་མཁའ་ ལྡིང་ དང་ །_ མི འམ་ ཅི་ དང་ །_ ལྟོ་འཕྱེ་ ཆེན་པོ་ དག་ གིས་ ཀྱང་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཇི་ལྟ ར་ གནས་པ་ བཞིན་ དུ་ མཐོང་ ངོ་ །_།
en: thus the four assemblies, the Brahmā assembly, the assembly of the gods of the desire realm, as well as the other gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, and mahoragas all saw the world as it is.

source: དེ་ནས་ དེ འི་ ཚེ་ཚེ་ དང་ ལྡན་པ་ མཽད་གལ་ གྱི་ བུ་ཆེན་ པོ་ སྟན་ ལས་ ལངས་ ཏེ །_ |#| ཆོས་གོས་ ཕྲག་པ་ གཅིག་ ཏུ་ གཟར་ ནས་ པུས་མོ་ གཡས་པ འི་ ལྷ་ང་ ས་ ལ་ བཙུགས་ ཏེ །_
en: $209 At this point the venerable Mahā­maudgalyā­yana rose from his seat, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེ་ ལོགས་ སུ་ ཐལ་མོ་ སྦྱར་བ་ བཏུད་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Joining his palms, he bowed toward the Blessed One and said,

source: བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་ དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ཇི་ཙམ་ དུ་ ཤིན་ཏུ་ རྫུ་འཕྲུལ་ ཆེན་པོ་ དང་ ལྡན་པ་ ནི་ ངོ་མཚར་ ལགས་སོ །_།
en: “Blessed One, the bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin’s mastery of supernatural powers is amazing.

source: བཅོམ་ལྡན་འདས་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ དང་ །_ བཅོམ་ལྡན་འདས་ ཀྱང་ མངོན་པར་ བཏེག་ ནས་ |#| འཇིག་རྟེན་ གཞན་ དུ་ བཞག་ ལགས་ ཀྱང་ །_
en: Blessed One, he took this world, including the Blessed One himself, and hurled it into another world.

source: དེ འི་ ཚེ་ བདག་ གིས་ མཚན་མ་ ཡང་ མ་འཚལ་ ཅིང་ །_ རྫུ་འཕྲུལ་ གྱི་ མིང་ ཡང་ མི་ དྲན་ ལགས་ ན་རྫུ་ འཕྲུལ་ མངོན་པར་ འགྲུབ་པ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ འཚལ །_
en: At that time I was unable to identify the characteristics and I could not even remember the names of any supernatural powers, so, needless to mention, I was unable to muster any such powers .

source: བཅོམ་ལྡན་འདས་ བདག་ ནི་ འདི་ སྙམ་ དུ་ སེམས་ ལགས་ ཏེ །_ |#| ཨ་ལ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ རྫུ་འཕྲུལ་ ཆེན་པོ་ དང་ ལྡན་པ་ ནི་ ངོ་མཚར་ རོ་ སྙམ་ ལགས་སོ །_།
en: Ah, Blessed One, I find it truly amazing that this bodhisattva possesses such supernatural powers.

source: བཅོམ་ལྡན་འདས་ བདག་ གིས་ དུས་འགྱུར་བ་ ཡང་ གློ་བ ར་ མ་ ཆུད་ ཅིང་ བདག་ཅག་ ཡུན་ ཇི་སྲིད་ ནས་ དྲངས་པ འམ །_ ཡུན་ ཇི་སྲིད་ ནས་ ཁྲིད་པ་ ཡང་ སྐད་ཅིག་ གཅིག་ དང་ །_ ཐང་ ཅིག་ གཅིག་ ཙམ་ ཡང་ གློ་ བ ར་ མ་ ཆུད་ ལ །_ |#| ཡུད་ཙམ་ གཅིག་ ཀྱང་ རྗེས་སུ་ མི་ དྲན་ ལགས་ ཀྱང་ བདག་ ནི་ འདི་ སྙམ་ སེམས་ ལགས་ ཏེ །_
en: Blessed One, when I carefully scan the changing times I do not recognize even a moment or an instant of such hauling and transportation being performed by any of us.#18

source: རེ་ཞིག་ བྱང་ཆུབ་ སེམས་དཔ འི་ རྫུ་འཕྲུལ་ དེ་ཡང་ དེ་ལྟ་ བུ་ ལགས་ ན་ དེ་བཞིན་ གཤེགས་པ འི་ ལྟ་ སྨོས་ཅི་ འཚལ་ སྙམ་ ལགས་སོ །_།
en: If even a bodhisattva can possess such supernatural powers, then what to say of the powers of the thus-gone ones?” [39.b]

source: བཅོམ་ [39b] ལྡན་ འདས་ ཀྱིས་ ཚེ་ དང་ ལྡན་པ་ མཽད་གལ་ གྱི་ བུ་ ལ་ བཀའ་ སྩལ་པ་
en: replied the Blessed One,

source: མཽད་གལ་ གྱི་ བུ་ ཁྱོད་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ དྲངས་ ཤིང་ཀུན་ དུ་ དྲངས་པ འམ །_ དེ་བཞིན་ གཤེགས་པ་ ཁྲིད་ ཅིང་ ཀུན་ དུ་ ཁྲིད་ དོ་ སྙམ་ དུ་ སེམས་ ན །_ |#| མཽད་གལ་ གྱི་ བུ་ ཁྱོད་ ཀྱིས་ དེ་ལྟ ར་ བལྟ་བ ར་ མི་ བྱ འོ །_།
en: $210 “Maudgalyāyana,” |#| “you should not think that this world was hauled or that the Thus-Gone One was transported.

source: མཽད་གལ་ གྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ འི་ ཆོས་གོས་ ཀྱི་ གྲྭ་ ཙམ་ ཡང་ བསྒུལ་བ འི་ བདག་པོ ར་ གྱུར་པ་ གཞན་ དགེ་སྦྱོང་ ངམ །_ བྲམ་ཟེ འམ །_ ཉན་ཐོས་ སམ །_ རང་ སངས་རྒྱས་ སམ་ ལྷ་ ནས་ ལྟོ་འཕྱེ་ ཆེན་པོ འི་ བར་ དུ་ ཡང་ ངས་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ ན་
en: Maudgalyāyana, I do not perceive any mendicant, priest, hearer, or solitary buddha, nor anyone from among the gods up to and including the mahoragas either, who is capable of moving even a fold in the Thus-Gone One’s Dharma robe.

source: དེ་བཞིན་ གཤེགས་པ་ མངོན་པར་ འདེགས་པ ར་ ནུས་པ ར་ འགྱུར་བ་ ལྟ་ཅི་ སྨོས་ ཏེ་
en: What then to say about actually lifting up the Thus-Gone One?

source: དེ་ ནི་ གནས་ མེད་ དོ །_།
en: That is clearly impossible.

source: མཽད་གལ་ གྱི་ བུ་ རེ་ཞིག་ ལྷ་ དང་ བཅས་པ འི་ འཇིག་རྟེན་ ལྟ་ཞོག་ གི _། མཽད་གལ་ གྱི་ བུ་ ཡོངས་སུ་ བརྟག་པ་ བཟུང་ སྟེ །_
en: For the time being, Maudgalyāyana, set aside the world with its gods, and imagine instead, Maudgalyāyana, the following scenario.

source: སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ སེམས་ཅན་ གཟུགས་ཅན་ ནམ །_ གཟུགས་ཅན་ མ་ ཡིན་པ འམ །_ འདུ་ཤེས་ ཅན་ ནམ །_ འདུ་ཤེས་ ཅན་ མ་ཡིན་པ འམ །_ འདུ་ཤེས་ ཅན་ ཡང་ མ་ ཡིན་ འདུ་ཤེས་ ཅན་ མ་ཡིན་པ་ ཡང་ མ་ཡིན་པ་ ཇི་སྙེད་ ཡོད་པ་ སེམས་ཅན་ དུ་ གདགས་པ ས་ གདགས་པ་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ ཐམས་ཅད་ མི འི་ ལུས་ ཐོབ་པ ར་ གྱུར་ ཏེ |#| མི འི་ ལུས་ ཐོབ་ ནས་ |#| རབ་ཏུ་ བྱུང་བ ར་ གྱུར་ ལ །_
en: Within the trichiliocosm there are beings with form just as there are formless beings. |#| There are beings involved in perception, beings not involved in perception, and beings neither involved nor not involved in perception. |#| Imagine now that they all achieve a human body, and with that human body they go forth.

source: རབ་ཏུ་ བྱུང་བ་ དེ་དག་ ཐམས་ཅད་ ཀྱིས་ དགྲ་བཅོམ་པ་ ཉིད་ རྗེས་སུ་ ཐོབ་པ ར་ གྱུར་ ཅིང་ མངོན་པར་ ཤེས་པ་ དྲུག་ མངོན་དུ་ བྱས་པ ར་ གྱུར་ ལ །_
en: Having gone forth, they also achieve the state of a worthy one and they gain the six superknowledges.

source: མཽད་གལ་ གྱི་ བུ་དཔེ ར་ ན་ ད་ལྟ ར་ ཁྱོད་ བཞིན་ དུ་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ དེ་ལྟ་ བུ་ དང་ ཡང་ ལྡན་པ ར་ གྱུར་ ན
en: $211 Maudgalyāyana, to illustrate this, imagine that they gain just as great miraculous abilities as the ones you possess.

source: མཽད་གལ་ གྱི་ བུ་ འདི་ ཇི་སྙམ་ དུ་ སེམས །_
en: Maudgalyāyana, what do you think?

source: རྫུ་འཕྲུལ་ དང་ ལྡན་པ་ འདུས་པ་ དེ་ མང་བ་ ཡིན་ ནམ །_
en: Will that gathering of beings with miraculous abilities then have increased?”

source: བཅོམ་ལྡན་འདས་ དེ་ལྟ་ ལགས་སོ །_།
en: “Yes, it will, Blessed One,”

source: མཽད་གལ་ གྱི་ བུ་ ཉན་ཐོས་ དེ་དག་ གིས་ སྟོང་ གི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ལག་པ་ གཅིག་ གིས་ བླངས་ ཤིང་ །_ སྟོང་ གཉིས་ པ་ དང་ །_ སྟོང་གསུམ་ གྱི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱང་ ལག་པ་ གཅིག་ གིས་ བླངས་ ནས་ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དུ་ འཆག་པ ར་ གྱུར་ ཀྱང་ །_
en: $212 “Maudgalyāyana, these hearers may lift up a thousandfold universe, or millionfold universe, or a trichiliocosm, and transport it beyond as many universes as there are grains of sand in the river Ganges. |#| Yet
